posts/recon/nmap/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Reconnaissance:  Nmap | HitchHikers guide to Ethical Hacking</title>
<link href="../../../assets/css/bootstrap.min.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/html4css1.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/nikola_rst.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/code.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/colorbox.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/theme.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/custom.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../../rss.xml">
<link rel="canonical" href="http://127.0.0.1:8000/posts/recon/nmap/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Dang">
<link rel="prev" href="../../git/" title="Introduction to git" type="text/html">
<link rel="next" href="../../nikola-guide/" title="Nikola Guide" type="text/html">
<meta property="og:site_name" content="HitchHikers guide to Ethical Hacking">
<meta property="og:title" content="Reconnaissance:  Nmap">
<meta property="og:url" content="http://127.0.0.1:8000/posts/recon/nmap/">
<meta property="og:description" content="Finding remote machines and the services that run on them.






NMAP


Used to scan for services.



Impoprtant stuff to rememebr is the -sN (no DNS lookup as it really sucks in the lab)
Nmap for thi">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-08-17T16:26:04Z">
<meta property="article:tag" content="nmap">
<meta property="article:tag" content="recon">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="http://127.0.0.1:8000/">

                <span id="blog-title">HitchHikers guide to Ethical Hacking</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../../posts">Posts</a>
                </li>
<li>
<a href="../../../archive.html">Archive</a>
                </li>
<li>
<a href="../../../categories/">Tags</a>
                </li>
<li>
<a href="../../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Reconnaissance:  Nmap</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Dang
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2017-08-17T16:26:04Z" itemprop="datePublished" title="2017-08-17 16:26">2017-08-17 16:26</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
Finding remote machines and the services that run on them.
</p>


<!-- TEASER_END -->

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">NMAP</h2>
<div class="outline-text-2" id="text-1">
<p>
Used to scan for services.
</p>

<p>
Impoprtant stuff to rememebr is the <b>-sN</b> (no DNS lookup as it really sucks in the lab)
Nmap for this.  My own method is to do
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Scan for Machines</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This is pretty quick, and gives a nice idea of what is about
</p>

<div class="highlight"><pre><span></span>nmap -n --top-ports<span class="o">=</span><span class="m">100</span> <span class="m">192</span>.168.0.1-255
</pre></div>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Output to files</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Good with Grep and friends.
</p>
</div>
</div>
</div>



<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">NSE</h2>
<div class="outline-text-2" id="text-2">
<p>
Loads at 
</p>

<p>
Nikto like scan of web
</p>

<p>
Anonymous FTP
</p>

<p>
Samba
</p>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Web Apps</h2>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Post Exploit</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">Nix</h3>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">Dohs</h3>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../../categories/nmap/" rel="tag">nmap</a></li>
            <li><a class="tag p-category" href="../../../categories/recon/" rel="tag">recon</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../../git/" rel="prev" title="Introduction to git">Previous post</a>
            </li>
            <li class="next">
                <a href="../../nikola-guide/" rel="next" title="Nikola Guide">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:aa9863@coventry.ac.uk">CUEH</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../../assets/js/jquery.min.js"></script><script src="../../../assets/js/bootstrap.min.js"></script><script src="../../../assets/js/moment-with-locales.min.js"></script><script src="../../../assets/js/fancydates.js"></script><script src="../../../assets/js/jquery.colorbox-min.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
